Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K20.tmx
Source language: en_us
Languages: zh_cn

source: The Apartment
zh_cn: 小区

source: uise knew by the new name on the call box that someone had moved in. She'd seen lights and movement in the apartment, which was across the courtyard from her and Martin, for the past few days.
zh_cn: 看着门口对讲机上的新名字，露易斯知道这房子有人搬进来住了。她跟马丁住一起，过去几天里，他们总是看到院子对面的房间亮着灯，有人影晃动。

source: The new name confirmed it. Someone had finally bought the place.
zh_cn: 一看名字就确定无疑，终于有人买下了那个地方。

source: The name had been typed on a small piece of green paper and taped to the call box beside the apartment's number.
zh_cn: 写着新住户名字的绿色小纸板就贴在房间号码旁。

source: Louise had once known a man with the name Jahani.
zh_cn: 露易斯曾经认识一个叫贾哈尼阿曼的男人。

source: Arman had been a doctoral student in French the year she started at Stockholm University.
zh_cn: 那年她刚考入斯德哥尔摩大学，阿曼已经开始在攻读法语博士学位。

source: He'd taught the conversation tutorial she took fall term.
zh_cn: 那年秋季阿曼辅导她的学期法语会话课程。

source: She looked at the green paper again.
zh_cn: 她又望了一眼那张绿色小纸。

source: All that was so long ago.
zh_cn: 那些是许久之前的事了。

source: He was the second man she'd slept with. Martin still didn't know about it.
zh_cn: 他是第二个睡她的男人，马丁对这件事一无所知。

source: She checked her watch.
zh_cn: 露易斯看了一眼手表。

source: She was on her way out to meet her son, Jonas, for lunch.
zh_cn: 她正赶着陪她儿子乔纳斯吃午饭。

source: The metro she wanted to take was due in ten minutes.
zh_cn: 她准备搭乘的那班地铁要十分钟后才到。

source: Arman had come from Iran to study, or maybe he'd come to escape the revolution. She couldn't recall the details now.
zh_cn: 阿曼是从伊朗来的，不知是来学习还是为了逃离国内的变革，她无法回忆得很仔细。

source: The years merged into one another.
zh_cn: 往日发生的事情混在了一起。

source: A bus rushed past on the street, and the blast of hot air stung her neck.
zh_cn: 突然一辆公交车急冲冲驶过，随即一阵热浪袭向她的脖子。

source: Jonas wanted to try a sushi restaurant he'd heard about.
zh_cn: 乔纳斯听说了一家寿司餐馆，想去试一试。

source: They took a table on the patio.
zh_cn: 他们在餐馆的露台处挑了一张桌子坐下。

source: It was September but very warm out.
zh_cn: 虽说已经是九月份了，可外面的天气还是暖和得很。

source: She let him order.
zh_cn: 她让乔纳斯点菜。

source: Arman had died in the early nineties. He was a professor of French at the university by then, and his death had been noted briefly in the culture section of DN.
zh_cn: 阿曼死于90年代初期，那时的他已经在大学里当法语教授，但关于他死去的消息只在每日新闻的文化版简短提示了一下。

source: One of his books about French cognates had caused a minor controversy.
zh_cn: 他写有一本关于法语同源方面的书引起了少数人士的争论。

source: His obituary had mentioned two children, she believed, a daughter and a son. Maybe one of them had moved into her building.
zh_cn: 他的讣告提到了他的两个孩子，她认为其中一个是他女儿，另外一个是儿子。或许其中一个就跟她同住一栋楼呢。

source: "News from home," she said after the waitress had brought their drinks - water for Jonas, white wine for Louise.
zh_cn: “最新消息，” 女侍者刚把他们的饮料放下，露易斯就开了口，她点了一杯白葡萄酒，乔纳斯要了一杯水。

source: Jonas hadn't lived with Louise and Martin for more than a decade, but she still thought of the apartment as his home.
zh_cn: 乔纳斯已经有十来年没跟露易斯还有马丁一起住了，但是她还是认为那里始终是他的家。”

source: "The apartment across the courtyard finally sold."
zh_cn: 院子对面的套房终于卖掉了。“

source: "The neighbor who died?" he said. "Dad mentioned it."
zh_cn: ”那个死去的邻居？“他说，”爸爸跟我说过了。

source: Martin served on the co-op board and would have known about the sale.
zh_cn: “ 马丁在小区的物业管理董事会上班，应该知道房子正在出售。

source: He rarely shared such information with Louise.
zh_cn: 对于此类信息他极少跟露易斯提起。

source: "That's right," she said.
zh_cn: ”对，没错。

source: "Barbro Ekman.
zh_cn: “ 她说，”就是那个巴布罗.埃克曼。

source: Her children had been trying to sell the place for months.
zh_cn: 她的儿女们一直都想着卖掉那个地方。

source: You can't imagine the smell when the body was first discovered."
zh_cn: 你肯定无法想象尸体被发现时那个味道有多难闻。

source: The apartment, which was one floor lower than her and Martin's, had been empty since Barbro Ekman died, shortly before Christmas the previous year.
zh_cn: “ 那间房子在她和马丁住的下一层楼，巴布罗埃克曼死后里面的东西就被清空了，刚好就是前年圣诞节快到的时候。

source: Her body was found only after Martin, who'd gone up to the attic storage area on that side of the building to retrieve a box of decorations, smelled the decomposition. The air was sour and rotten, even two floors up.
zh_cn: 当时马丁去了公寓楼边上的储物室顶楼要取回圣诞节用的整箱装饰品，闻到了腐烂的气味，这才发现她的尸体。

source: He'd been upset that no one in the building had noticed for so long, that no one who lived closer to Barbro Ekman had been alarmed by the overwhelming stench.
zh_cn: 那天过后，他一直气愤不安，这么久了整栋楼居然都没有人察觉到有人死了，住得离他近一点的人居然也没有一个被那股臭味熏到。”

source: "They're all so selfish," he'd said.
zh_cn: 他们太自私了。“ 马丁说。

source: But Louise suspected he was really only upset that he'd been the one to make the discovery.
zh_cn: 但是露易斯推测他之所以愤怒不安，是因为他是唯一一个发现尸体的人。

source: Jonas took a drink of his water. "Gruesome," he said.
zh_cn: 乔纳斯喝了一口他的那杯水。”被吓到了。“他说

source: It had been snowing the day the cleaning company came.
zh_cn: 清洁公司来的那天一直在下雪。

source: She'd watched from her kitchen as they worked.
zh_cn: 她一直站在厨房往外看他们工作。

source: They scrubbed walls and floors, removed furniture. They even took some of the fixtures and appliances from the kitchen.
zh_cn: 他们把墙还有门都擦了一遍，把家具搬掉，甚至连厨房的电器还有餐具都带走了。

source: The idea that humans are so unclean on the inside had preoccupied Louise for weeks.
zh_cn: 一连几个星期露易斯内心都萦绕着这种想法，人心太需要清扫了。”

source: "Well," she told her son, "I can't imagine what a relief it must be to her family."
zh_cn: 总之，“她告诉儿子，”我无法想象这对于她的家人来讲会是怎么样一种解脱。“

source: "I don't think I ever met that woman," Jonas said.
zh_cn: ”我觉得好像从未见过那个人，“乔纳斯说。”

source: "Not that I remember."
zh_cn: 我记得是没有的。“

source: "She was very old," Louise said.
zh_cn: ”她很老啦。“ 露易斯说。

source: She didn't know if he was telling the truth or saying this only to annoy her.
zh_cn: 她并不知道儿子说的是否属实，或者他说这些只是为了让她分心不去想那么多。

source: From the bedroom on the courtyard side of their apartment there was a clear view of Barbro Ekman's living room.
zh_cn: 从靠近院子一侧的寝室可以清楚地看见巴布罗埃克曼的客厅。

source: When Jonas was young, that bedroom had been his.
zh_cn: 乔纳斯小时候就住在这间房。

source: Now Martin used it as an office.
zh_cn: 现在房间被马丁用来做办公室。

source: She rarely went into the room anymore.
zh_cn: 她极少再走进那房间了。

source: Martin was private about so much.
zh_cn: 马丁很注重个人隐私。”

source: "Do you remember the blue light from her window?" she asked Jonas. "How it used to reflect on the flower box?"
zh_cn: 你记得她窗口蓝色的光吗？”她问乔纳斯，“怎么一直都反射在花箱上呢？”

source: "I think so," he said.
zh_cn: “记得。” 他说。

source: "It used to scare you."
zh_cn: “以前那总吓着你。”

source: He tore open the paper wrapping of the chopsticks, pulled them apart, and rubbed them together to smooth the edges.
zh_cn: 他拆开包住筷子的纸，把筷子扯开，磨了磨，这样筷子不会那么扎手。

source: "It was so easy to explain," she said.
zh_cn: “其实很容易解释的。”

source: "It was just her television, I always told you. But you never believed me."
zh_cn: 她说，” 是她的电视反射出来的而已，我一直这么告诉你的，可你却从来都不信。“

source: The waitress arrived with two rectangular plates and set them down in the center of the table.
zh_cn: 女侍者端来两个长方形碟子，放在餐桌的正中间。

source: Colorful pieces of fish were arranged on each plate.
zh_cn: 每个碟子上的鱼片五颜六色的。

source: Louise had tried to listen to what Jonas had ordered for them both and to follow along by looking at the pictures in her own menu, but now that the food had arrived she couldn't tell one piece of fish from another.
zh_cn: 乔纳斯点菜的时候，露易斯边听边对着自己手上的菜单，但是现在东西都端上来了，露易斯却分不清哪些是哪些了。

source: Jonas pointed with his chopsticks. "Salmon," he said. "And yellowtail. Whitefish. Eel on this plate here."
zh_cn: 乔纳斯拿筷子指着每一片鱼肉，”这是大马哈鱼，“他说，”这是鲱鱼，白鲑鱼。这一碟是鳗鱼。”

source: She'd always disliked eel.
zh_cn: 一直以来她都不喜欢鳗鱼。

source: Eels could travel great distances out of the water, and she found this disturbing.
zh_cn: 鳗鱼离开水还能移动很远的距离，这一点让她觉得很不自在。

source: "Who bought the apartment?" Jonas asked.
zh_cn: “谁买下了那间套房了？” 乔纳斯问。

source: "I only know a name," Louise said.
zh_cn: “我只知道名字，” 露易斯说。

source: Arman had been a good teacher.
zh_cn: 阿曼是个不错的老师。

source: She could still conjugate several French verbs, hear him reading from lists he'd written on the chalkboard: present indicative, present conditional, present subjunctive.
zh_cn: 她现在都还懂得区分动词的不同形式，他把它们列出来写在黑板上——现在时、现在条件句、现在虚拟式——并读出来的声音她还记得。

source: She remembered the strangest things.
zh_cn: 她记得那些最奇怪的事情。

source: There couldn't be that many Jahanis in Stockholm.
zh_cn: 在斯德哥尔摩像乔哈尼这样的人并不多。

source: Jonas was thirty-four. Would she feel jealous or relieved if the person in the apartment was close to that age?
zh_cn: 乔纳斯已经34了，假如新住进公寓的人年纪也差不多的话，不知她是否会嫉妒还是释怀呢？

source: She watched her son eat.
zh_cn: 她看着儿子吃东西。

source: He talked about a problem at his office. An e-mail had accidentally been sent to the wrong person, and Jonas found this uncomfortably funny.
zh_cn: 他谈起了在办公室发生的一件事，不小心把一封邮件发给了另外一个人。这让他不安又觉得有趣。

source: He'd been in his current position for only a year, and everything he said about his job, positive or negative, surged with fresh excitement.
zh_cn: 他在自己的位置上只呆了一年，每次只要谈起工作，不论好的坏的，他总说得新奇又兴奋。

source: When they finished, Jonas insisted on paying the check. As he was figuring out the tip, she typed an e-mail on her phone reminding herself to deposit money into his account.
zh_cn: 东西吃完之后，乔纳斯坚持要买单。当他正考虑要给多少小费的时候，露易斯在手机上写了一封邮件，提醒自己要把钱付到她儿子账户。

source: She walked him back to work. They said goodbye to each other outside the building's glass-walled entryway.
zh_cn: 她步行着送他回去上班，在大厦的玻璃墙入口处互相道别。

source: Jonas vanished into the crowd of office workers.
zh_cn: 乔纳斯的身影消失在上班族的人群中。

source: It was remarkable how similar to her son they all looked.
zh_cn: 这些人看起来跟她儿子异常相似。

source: It had been the same when he was in school.
zh_cn: 他以前还呆在学校的时候，这样的场景经常看到。

source: The children were all identical.
zh_cn: 小孩子看起来都差不多。

source: Hundreds of them crowded the spaces of his childhood.
zh_cn: 在他的童年时代，身边总有一群群的玩伴陪伴。

source: His soccer matches, ski lessons, piano classes.
zh_cn: 足球比赛，滑雪课，钢琴班。

source: She'd always been at ease with the idea of being the mother of a child who was like everyone else. It was a relief to exist so close to the middle.
zh_cn: 作为一个普通孩子的母亲，这常常让她感到宽慰。儿子周围有那么多的人，这多少减轻了她的不安。

source: There were so many fewer risks.
zh_cn: 总有少数危险的人躲在人群中。

source: She watched the crowd fill the lobby.
zh_cn: 她看到大堂里满满都是人。

source: They could all be my children, she thought.
zh_cn: 这些人有可能都是我的孩子，她想。

source: She decided to walk home.
zh_cn: 她决定走路回家。

source: Systembolaget had a branch near Jonas's office, and she wanted to buy a bottle of wine.
zh_cn: 在乔纳斯公司附近有家西登斯分店，她想过去买瓶酒。

source: It embarrassed her to buy wine more than twice a week from the same Systembolaget, and she'd been to the location closer to her apartment just the day before.
zh_cn: 前天去了小区附近那家店买过一次酒，而一想到一星期去同一家店买超过两次酒这回让她觉得尴尬。

source: Lately, she'd been interested in South African wines.
zh_cn: 到店后不久，她对南非的红酒有了兴趣。

source: She picked two bottles of a Cabernet that, according to a sign fastened to the shelf in the store, had ranked very highly in a blind taste test.
zh_cn: 她挑了两瓶红葡萄酒，按照酒架上贴着的标签，这款酒在盲测中排名较靠前。

source: She paid for the wine, and, as she left the store, she looked up and down the street to see if there was anyone who might recognize her.
zh_cn: 她付了钱，离开商店时她来回扫了一眼街上的人，看看路上是否有认识自己的人。

source: Then she stuffed the bottles into her purse, concealing what wouldn't fit all the way in with her scarf, and walked the rest of the way home.
zh_cn: 她把手里的两瓶酒塞进袋子里，这样才不会显得与戴着围巾的她格格不入，并沿着刚刚的路线回家了。

source: The green piece of paper was still there on the call box, partly obscuring the name Ekman.
zh_cn: 绿色的纸片依旧贴在公用电话箱那里，部分遮住了埃克曼的名字。

source: One corner of the paper curled outward in the heat.
zh_cn: 纸片的一角向外卷曲。

source: With her fingernail, she started to peel the tape off so that she could reposition it over the paper, but she stopped herself.
zh_cn: 她开始用指甲把纸片撕下来以便能够重新贴在埃克曼那张纸上，但是她又停了下来。

source: She set her purse on the kitchen counter.
zh_cn: 她把袋子放在厨房台面上。

source: The bottles clinked.
zh_cn: 瓶子叮当响了一下。

source: It was two, according to the oven clock.
zh_cn: 如果是烤箱的响声，那就代表两分钟过去了。

source: Martin was at work.
zh_cn: 马丁外出了。

source: That evening he was going out with colleagues to celebrate his retirement.
zh_cn: 那天晚上他跟同事一起出去庆祝退休。

source: They were taking him to a karaoke bar.
zh_cn: 他们带他去卡拉OK唱歌 。

source: She didn't expect him to be home until late.
zh_cn: 她希望他不要太早回家。

source: Martin was retiring early. They didn't need the money, and he was bored with work.
zh_cn: 马丁算是比较早退休的，一方面他们的钱足够花，另一方面他对工作也已厌倦了。。

source: She opened one of the bottles of wine and poured herself a glass.
zh_cn: 她开了一瓶酒，倒了一杯。

source: Sometimes she worried that she was damaging her health.
zh_cn: 有时候她会觉得喝酒有损自己的健康。

source: The music was still playing, and it seeped clearly into the kitchen from the open window.
zh_cn: 哪里的音乐一直在响，站在开着窗的厨房可以听得很清楚。

source: She took her wine to the balcony and sat looking out over the courtyard.
zh_cn: 她举着酒杯来到阳台并坐着往院子那边看去。

source: The curtains in Barbro Ekman's apartment were drawn, and the apartment was dark.
zh_cn: 巴布罗埃克曼房子的窗帘被拉上了，整所房子黑漆漆的。

source: She could hear the music from the ground floor. A new song came on, one she recognized.
zh_cn: 她听到音乐是一楼那边传来的。现在在播另一首歌，她知道这首歌。

source: She mouthed along to a few words of the chorus, took a sip of her wine.
zh_cn: 她跟着歌声也哼着几句歌词出来，然后喝了一小口酒。

source: The wine tasted good, and the song reminded her of somewhere nice.
zh_cn: 酒的味道不错，歌曲也让她联想起美好的某处。

source: She couldn't place the memory exactly, but it made her think of the outdoors, of a beautiful view.
zh_cn: 她没办法确切说出地名，但她又想起了屋外漂亮的景色。

source: There were trees and snow.
zh_cn: 外面种着许多树，积雪满地。

source: Maybe the song had played on the radio frequently during a trip they'd once taken.
zh_cn: 或者在他们人生的某一次旅行中，也会经常听这首歌呢。

source: In the apartment just below Barbro Ekman's place lived a woman named Johanna. Her two sons were grown now.
zh_cn: 巴布罗埃克曼楼下住着一个叫乔哈娜的女人，她的两个孩子已经长大了。

source: One of them played ice hockey in America, somewhere in the Southern states, Louise thought - North Carolina, maybe.
zh_cn: 其中一个去了美国当起职业曲棍球选手，应该是在南方某州的某个城市吧，或许是北卡罗莱纳州吧。

source: The other was a lawyer up north, in Kiruna.
zh_cn: 另外一个北上去了基律纳市做律师。

source: Louise remembered when the family had moved in. The boys were so young. That was right before Louise had become pregnant with Jonas.
zh_cn: 露易斯记得她们刚搬进来住的时候，两个男孩还很小，不久之后她就怀上了乔纳斯。

source: She'd liked the family. She'd helped the boys plant a small herb garden on her balcony, because it faced east and got good morning sun.
zh_cn: 她很喜欢那家人，还帮两个男孩在她的阳台那里养了几株香草植物，因为阳台朝东，早上的阳光照射得到。

source: Once, about a month before Jonas was born, Johanna had asked Louise to babysit the older of her sons.
zh_cn: 大约是在乔纳斯出生的前一个月，有一次乔哈娜拜托露易斯帮忙照看一下她的大儿子。

source: The younger one was very sick, and Johanna hadn't wanted to take them both to the hospital.
zh_cn: 小儿子病得很严重，但是乔哈娜并不想把两个孩子都带去医院。

source: Louise wasn't feeling well herself and didn't want to catch whatever the boy had. So she volunteered Martin to go in her place.
zh_cn: 露易斯身体有点不适，无心顾管那个男孩，于是她自作主张让马丁来做这件事。

source: After barely an hour, he came back.
zh_cn: 仅仅一个小时过后，他跑回家里了。

source: She heard his footsteps in the hall outside their apartment. She heard the front door open and Martin's heavy tread as he walked to the bedroom.
zh_cn: 她听到门外走廊响起他的脚步声，随后前门开了，马丁踏着沉重的脚步走向卧室。

source: He was tired, he told her, and had forgotten to take a book to read.
zh_cn: 他很累地对着她说，忘记把书带过去读了。

source: "Who's watching him?" she asked. "Has Johanna come home?"
zh_cn: “那现在谁在看着他？” 她问，“乔哈娜回来了吗？”

source: The bed was warm and comfortable, and, silhouetted in the doorway, Martin appeared much larger than he actually was.
zh_cn: 床又暖又舒服，倒影在门口，马丁整个身躯看起来比实际的要大。

source: "I need to find my book," he said.
zh_cn: “我要找找我的书才行。” 他说。

source: "They have books there," she said. "And a television."
zh_cn: “他们那边有书，” 她说，“也有电视。”

source: "I'm tired, Louise," he said.
zh_cn: ”我累死啦，露易斯。“ 他说。

source: Then the shadow of her husband stepped out of the doorway and disappeared into the hall.
zh_cn: 言毕，她看着丈夫的影子走出门口，消失在走廊里。

source: She heard a door open and close, then the airy creak of leather as he settled into his chair in the living room.
zh_cn: 她听见门开了又关上，有皮革的吱嘎声传来，他已经整个人安在了客厅的椅子上了。

source: She got out of bed and wrapped herself in her robe.
zh_cn: 她从床上爬起，披上睡袍。

source: It was the first time she could remember hating her husband.
zh_cn: 记忆中这是她第一次讨厌她的丈夫。

source: Over the years that had become such a familiar, even comforting, feeling.
zh_cn: 这么多年过去了，她早已熟悉这种感觉，并对此感到欣慰。

source: It was cold out, and she crossed the courtyard as quickly as she could, taking care to avoid an icy patch where the shadow from a first-floor balcony kept the ground wet even in the warmest part of the day.
zh_cn: 外面很冷，她尽量快速穿过院子，小心避开有碎冰渣的路面，那里被一楼的阳台遮住了，即使是白天气温最高的时候，地面也经常是湿的。

source: She could remember so much about that evening, but not what the problem with the younger boy had been.
zh_cn: 当天晚上发生的许多事情她依旧记得，却不记得那个小儿子到底是得了什么病。

source: She couldn't recall Johanna's coming home. But she distinctly remembered waking up on Johanna's couch, her throat and stomach on fire with heartburn and hatred for Martin.
zh_cn: 她想不起乔哈娜是什么时候回到家的，但她确切地记得自己从乔哈娜家的沙发上醒，喉咙和胃都像火烧一样痛，心里依旧怨着马丁。

source: The next time she saw Johanna, she thought she'd ask her about that night.
zh_cn: 那次之后当她再遇见乔哈娜，她以为她会问起那天晚上发生的事情。
